<script lang="ts" setup>
import ContainerComponent from '@/components/layout/ContainerComponent.vue'
import Accordion from './UI/Accordion/Accordion.vue';

const generalItems = [
  {
    title: 'Полное наименование образовательной организации',
    content: 'Индивидуальный предприниматель Аладьина Вероника Евгеньевна'
  },
  {
    title: 'Сокращенное наименование образовательной организации',
    content: 'ИП Аладьина В.Е.'
  },
  {
    title: 'Дата создания образовательной организации',
    content: '22.12.2023'
  },
    {
    title: 'Краткая информация об образовательной организации',
    list: true,
    content: [
        'Полное наименование организации: Индивидуальный предприниматель Аладьина Вероника Евгеньевна',
        'Сокращенное наименование организации: ИП Аладьина В.Е.',
        'Юридический адрес: 630061, Новосибирская область, город Новосибирск, улица Краузе, дом 19, квартира 471',
        'Фактический адрес: 630061, Новосибирская область, город Новосибирск, улица Краузе, дом 19, квартира 471',
        'Телефон: +7 (913) 917 86 16, +7 (383) 299 86 16',
        'ИНН: 543314713600',
        'КПП: -',
        'ОГРНИП: 323547600137223',
        'ОКПО: 2025488696',
        'ОКАТО: 50401373000',
        'ОКВЭД: 85.41',
        'ОКФС/ОКОПФ: 16/50102',
        'АО «ТБанк»,',
        'Расчетный счет 40802810600005161897',
        'Корреспондентский счет 30101810145250000974',
        'БИК 044525974'
    ]
  },
  {
    title: 'Учредитель (учредители) образовательной организации:',
    content: 'Аладьина Вероника Евгеньевна +7 (913) 917 86 16, +7 (383) 299 86 16, baobei.nsk@gmail.com'
  },
  {
    title: 'Информация о месте нахождения образовательной организации:',
    list: true,
    content: [
        'Юридический адрес:',
        '630061, Новосибирская область, город Новосибирск, улица Краузе, дом 19, квартира 471',
        'Фактический адрес:',
        '630061, Новосибирская область, город Новосибирск, улица Краузе, дом 19, квартира 471'
    ]
  },
  {
    title: 'Информация о режиме и графике работы образовательной организации',
    content: 'Понедельник-суббота 9:00-21:00, Учебные занятия проводятся в соответствии с расписанием занятий'
  },
  {
    title: 'Информация о контактных телефонах образовательной организации, об адресах электронной почты и об официальном сайте образовательной организации',
    list: true,
    content: [
        'Контактные телефоны: +7 (913) 917 86 16, +7 (383) 299 86 16',
        'Адреса электронной почты: baobei.nsk@gmail.com',
        'Официальный сайт: https://baobei-online.ru/'
    ]
  },
  {
    title: 'Информация о филиалах образовательной организации (в том числе находящихся за пределами Российской Федерации)',
    content: 'Филиалы образовательной организации отсутствует'
  },
  {
    title: 'Информация о представительствах образовательной организации (в том числе находящихся за пределами Российской Федерации)',
    content: 'Отсутствует'
  },
  {
    title: 'Информация о местах осуществления образовательной деятельности, в том числе сведения об адресах мест осуществления образовательной деятельности, которые в соответствии с частью 4 статьи 91 Федерального закона от 29 декабря 2012 г. № 273-ФЗ "Об образовании в Российской Федерации" не включаются в соответствующую запись в реестре лицензий на осуществление образовательной деятельности',
    list: 'true',
    content: [
        'Места осуществления образовательной деятельности, которые включаются в соответствующую запись в реестре лицензий на осуществление образовательной деятельности:',
        'В образовательной организации отсутствуют места осуществления образовательной деятельности, которые включаются в соответствующую запись в реестре лицензий на осуществление образовательной деятельности, в связи с отсутствием среди указанных в приложении к лицензии на осуществление образовательной деятельности образовательной организации программ, включающих места осуществления образовательной деятельности, которые включаются в соответствующую запись в реестре лицензий на осуществление образовательной деятельности'
    ]
  },
  {
    title: 'Места осуществления образовательной деятельности при использовании сетевой формы реализации образовательных программ',
    content: 'В образовательной организации отсутствуют места осуществления образовательной деятельности при использовании сетевой формы реализации образовательных программ, в связи с отсутствием среди указанных в приложении к лицензии на осуществление образовательной деятельности образовательной организации программ, включающих места осуществления образовательной деятельности при использовании сетевой формы реализации образовательных программ'
  },
  {
    title: 'Места проведения практики',
    content: 'В образовательной организации отсутствуют места проведения практики, в связи с отсутствием среди указанных в приложении к лицензии на осуществление образовательной деятельности образовательной организации программ, включающих места проведения практики'
  },
  {
    title: 'Места проведения практической подготовки обучающихся',
    content: 'В образовательной организации отсутствуют места проведения практической подготовки обучающихся, в связи с отсутствием среди указанных в приложении к лицензии на осуществление образовательной деятельности образовательной организации программ, включающих места проведения практической подготовки обучающихся'
  },
  {
    title: 'Места проведения государственной итоговой аттестации',
    content: 'В образовательной организации отсутствуют места проведения государственной итоговой аттестации, в связи с отсутствием среди указанных в приложении к лицензии на осуществление образовательной деятельности образовательной организации программ, включающих места проведения государственной итоговой аттестации'
  },
  {
    title: 'Места осуществления образовательной деятельности по дополнительным образовательным программам',
    content: '1 Учебный корпус, 630061, Новосибирская область, город Новосибирск, улица Краузе, дом 19, квартира 471'
  },
  {
    title: 'Места осуществления образовательной деятельности по основным программам профессионального обучения',
    content: 'В образовательной организации отсутствуют места осуществления образовательной деятельности по основным программам профессионального обучения, в связи с отсутствием среди указанных в приложении к лицензии на осуществление образовательной деятельности образовательной организации программ, включающих места осуществления образовательной деятельности по основным программам профессионального обучения'
  }
];

const structureItems = [
    {
        title: 'Органы управления образовательной организации',
        list: true,
        content: [
            'Администрация, директор: Аладьина Вероника Евгеньевна',
            '630061, Новосибирская область, город Новосибирск, улица Краузе, дом 19, квартира 471',
            'https://baobei-online.ru/',
            'baobei.nsk@gmail.com',
            '+7 (913) 917 86 16, +7 (383) 299 86 16'
        ]
    },
    {
        title: 'Иные структурные подразделения',
        content: 'Иные структурные подразделения не предусмотрены'
    }
];

const documentItems = [
    {
        title: 'Устав образовательной организации',
        content: 'Устав не предусмотрен'
    },
    {
        title: 'Свидетельство о государственной аккредитации (с приложениями) (при наличии)',
        content: 'Свидетельство о государственной аккредитации (с приложениями) не предусмотрено'
    },
    {
        title: 'Правила внутреннего распорядка обучающихся',
        content: 'Документ в разработке'
    },
    {
        title: 'Правила внутреннего трудового распорядка',
        content: 'Документ в разработке'
    },
    {
        title: 'Коллективный договор (при наличии)',
        content: 'Коллективный договор не предусмотрен'
    },
    {
        title: 'Отчёты о результатах самообследования',
        content: 'Отчет о самообследовании не предусмотрен'
    }
];

const actItems = [
    {
        title: 'Правила приема обучающихся',
        content: 'Документ в разработке'
    },
    {
        title: 'Режим занятий обучающихся',
        content: 'Документ в разработке'
    },
    {
        title: 'Формы, периодичность и порядок текущего контроля успеваемости и промежуточной аттестации обучающихся',
        content: 'Документ в разработке'
    },
    {
        title: 'Порядок и основания перевода, отчисления и восстановления обучающихся',
        content: 'Документ в разработке'
    },
    {
        title: 'Порядок оформления возникновения, приостановления и прекращения отношений между образовательной организацией и обучающимися и (или) родителями (законными представителями) несовершеннолетних обучающихся',
        content: 'Документ в разработке'
    }
];

const educationItems = [
    {
        title: '',
        content: ''
    }
]
</script>
<template>
    <section class="about">
        <ContainerComponent>
            <div class="info">
                <div class="content">
                    <h6>1. Подраздел «Основные сведения»</h6>
                    <Accordion :items="generalItems" :multiple="true" />
                    <h6>2. Подраздел «Структура и органы управления образовательной организацией»</h6>
                    <Accordion :items="structureItems" :multiple="true" />
                    <h6>3. Подраздел «Документы»</h6>
                    <Accordion :items="documentItems" :multiple="true" />
                    <h6>4. Локальные нормативные акты образовательной организации по основным вопросам организации и осуществления образовательной деятельности, в том числе регламентирующие</h6>
                    <Accordion :items="actItems" :multiple="true" />
                    <h6>5. Подраздел «Образование»</h6>
                    <Accordion :items="educationItems" :multiple="true" />
                </div>
            </div>
        </ContainerComponent>
    </section>
</template>
<style lang="scss" scoped>
.about {
    background-color: var(--card-pink);
    padding-top: 60px;
    .container {
        display: flex;
        flex-direction: column;
        .info {
            display: flex;
            flex-direction: row;
            gap: 60px;
            margin-bottom: 60px;
            .content {
                width: 100%;
                h6 {
                    font-size: 22px;
                    margin: 28px 0;
                }
                ul {
                    list-style-type: none;
                    margin: 0;
                    padding: 0;
                    margin-bottom: 20px;
                    li {
                        font-size: 18px;
                        line-height: 30px;
                        font-weight: lighter;
                    }
                }
            }
        }
    }
}

@include breakpoint(md) {
    .about {
        .container {
            .info {
                flex-direction: column;
                gap: 60px;
            }
        }
    }
}
</style>
