<script lang="ts" setup>
import ContainerComponent from '@/components/layout/ContainerComponent.vue'
import Accordion from './UI/Accordion/Accordion.vue';


const generalItems = [
    {
        title: 'Полное наименование образовательной организации',
        content: 'Индивидуальный предприниматель Аладьина Вероника Евгеньевна'
    },
    {
        title: 'Сокращенное наименование образовательной организации',
        content: 'ИП Аладьина В.Е.'
    },
    {
        title: 'Дата создания образовательной организации',
        content: '22.12.2023'
    },
    {
        title: 'Учредитель (учредители) образовательной организации:',
        content: 'Аладьина Вероника Евгеньевна +7 (913) 917 86 16, +7 (383) 299 86 16, baobei.nsk@gmail.com'
    },
    {
        title: 'Информация о месте нахождения образовательной организации:',
        list: true,
        content: [
            'Юридический адрес:',
            '630061, Новосибирская область, город Новосибирск, улица Краузе, дом 19, квартира 471',
            'Фактический адрес:',
            '630061, Новосибирская область, город Новосибирск, улица Краузе, дом 19, квартира 471'
        ]
    },
    {
        title: 'Информация о режиме и графике работы образовательной организации',
        content: 'Понедельник-суббота 9:00-21:00, Учебные занятия проводятся в соответствии с расписанием занятий'
    },
    {
        title: 'Информация о контактных телефонах образовательной организации, об адресах электронной почты и об официальном сайте образовательной организации',
        list: true,
        content: [
            'Контактные телефоны: +7 (913) 917 86 16, +7 (383) 299 86 16',
            'Адреса электронной почты: baobei.nsk@gmail.com',
            'Официальный сайт: https://baobei-online.ru/'
        ]
    },
    {
        title: 'Информация о филиалах образовательной организации (в том числе находящихся за пределами Российской Федерации)',
        content: 'Филиалы образовательной организации отсутствует'
    },
    {
        title: 'Информация о местах осуществления образовательной деятельности',
        list: true,
        content: [
            'Места осуществления образовательной деятельности, которые включаются в соответствующую запись в реестре лицензий на осуществление образовательной деятельности:',
            'В образовательной организации отсутствуют места осуществления образовательной деятельности, которые включаются в соответствующую запись в реестре лицензий на осуществление образовательной деятельности, в связи с отсутствием среди указанных в приложении к лицензии на осуществление образовательной деятельности образовательной организации программ, включающих места осуществления образовательной деятельности, которые включаются в соответствующую запись в реестре лицензий на осуществление образовательной деятельности'
        ]
    },
    {
        title: 'Лицензия',
        content: 'Л035-01199-54/01005520'
    },
    {
        title: 'Реквизиты',
        list: true,
        content: [
            'ИНДИВИДУАЛЬНЫЙ ПРЕДПРИНИМАТЕЛЬ АЛАДЬИНА ВЕРОНИКА ЕВГЕНЬЕВНА',
            'ИНН 543314713600',
            'ОРГНИП 323547600137223',
            'Расчетный счёт 40802810844750002594',
            'Наименование СИБИРСКИЙ БАНК ПАО СБЕРБАНК',
            'БИК 045004641',
            'Кор счёт 045004641',
            'ИНН 7707083893',
            'КПП 7707083893'
        ]
    }
];

const structureItems = [
    {
        title: 'Cтруктурные подразделения образовательной организации',
        list: true,
        content: [
            'Высшим органом управления является Руководитель: - Аладьина Вероника Евгеньевна',
            'Наименование структурного подразделения: -',
            'Руководитель структурного подразделения: -',
            'Место нахождения структурного подразделения: -',
            'Сайт структурного подразделения образовательной организации (при наличии): -',
            'Адрес электронной почты структурного подразделения: -',
            '<b>Органы управления образовательной организации</b>',
            'Наименование органа управления образовательной организации: -',
            'Руководитель органа управления образовательной организации: -',
            'Место нахождения органа управления образовательной организации: -',
            'Сайт органа управления образовательной организации (при наличии): -',
            'Адрес электронной почты органа управления образовательной организации: -'
        ]
    }
];

const documentItems = [
    {
        title: 'Устав образовательной организации',
        content: 'Устав не предусмотрен'
    },
    {
        title: 'Правила внутреннего распорядка обучающихся',
        content: 'Документ в разработке'
    },
    {
        title: 'Правила внутреннего трудового распорядка',
        content: 'Документ в разработке'
    },
    {
        title: 'Коллективный договор',
        content: 'Коллективный договор не предусмотрен'
    },
    {
        title: 'Отчёты о результатах самообследования',
        content: 'Отчет о самообследовании не предусмотрен'
    },
];

const educationItems = [
    {
        title: 'Реализуемые уровни образования',
        content: 'Дополнительное образование детей и взрослых'
    },
    {
        title: 'Формы обучения',
        content: 'Дистанционная'
    },
    {
        title: 'Языки, на которых осуществляется образование (обучение)',
        content: 'Русский, китайский, английский'
    },
    {
        title: 'Численность обучающихся по реализуемым образовательным программам',
        content: '30'
    },
    {
        title: 'Реализуемые образовательные программы',
        list: true,
        content: [
            '<a href="files/Think2StudentBook.pdf" target="_blank">Think Student Book 2</a>',
            '<a href="files/Think3StudentBook.pdf" target="_blank">Think Student Book 3</a>',
            '<a href="files/Think4StudentBook.pdf" target="_blank">Think Student Book 4</a>',
            '<a href="files/GatewayB1Students.pdf" target="_blank">Gateway 2nd Student Book</a>',
            '<a href="files/GatewayB2Studentsbook2nd.pdf" target="_blank">Gateway 2nd B2</a>',
            '<a href="files/Gateway2edB1plusWorkbook.pdf" target="_blank">Gateway workbook</a>',
            '<a href="files/op.docx" target="_blank">Образовательная программа</a>',
        ]
    }

];

const managementItems = [
    {
        title: 'Органы управления образовательной организации',
        list: true,
        content: [
            'Администрация, Директор: Аладьина Вероника Евгеньевна',
            '630061, Новосибирская область, город Новосибирск, улица Краузе, дом 19, квартира 471',
            'https://baobei-online.ru/',
            'baobei.nsk@gmail.com',
            '+7 (913) 917 86 16, +7 (383) 299 86 16',
        ]
    },
    {
        title: 'Иные структурные подразделения',
        content: 'Иные структурные подразделения не предусмотрены'
    }
];

const teacherItems = [
    {
        title: 'Преподаватели',
        list: true,
        content: [
            'Аладьина Вероника Евгеньевна',
            '630061, Новосибирская область, город Новосибирск, улица Краузе, дом 19, квартира 471',
            'https://baobei-online.ru/',
            'baobei.nsk@gmail.com',
            '+7 (913) 917 86 16, +7 (383) 299 86 16'
        ]
    }
];

const techItems = [
    {
       title: 'Материально-техническое обеспечение и оснащенность образовательного процесса',
       list: true,
       content: [
            'Материально-техническое обеспечение образовательной организации -',
            'Количество оборудованных учебных кабинетов учреждения -',
            'Объекты для проведения практических занятий -',
            'Библиотеки -',
            'Объекты спорта -',
            'Средства обучения и воспитания -',
            'Условия питания обучающихся -',
            'Условия охраны здоровья обучающихся -',
            'Доступ к информационным системам и информационно-телекоммуникационным сетям -',
            'Электронные образовательные ресурсы, к которым обеспечивается доступ обучающихся -'
       ]
    }
];

const payItems = [
    {
        title: 'Платные образовательные услуги',
        list: true,
        content: [
            'Обучение в ИП Аладьина В.Е. осуществляется на платной основе с заключением договора с родителями (законными представителями) обучающегося.',
            'В договоре определяются уровень образования, форма освоения образовательных программ, название программы, сроки обучения, порядок внесения платы за обучение и прочие условия, не противоречащие действующему законодательству Российской Федерации.',
            'Документы об установлении размера платы, взимаемой с родителей (законных представителей) -',
            '<a href="files/dogovor.docx" target="_blank"> Договор </a>',
            '<a href="files/soglasie.docx" target="_blank"> Согласие на обработку персональных данных </a>'
        ]
    }
];

const financeItems = [
    {
        title: 'Финансово-хозяйственная деятельность',
        list: true,
        content: [
            'Финансово-хозяйственная деятельность ИП Аладьина В.Е. осуществляется за счет поступления денежных средств по договорам об оказании платных образовательных услуг.',
            'Учреждение не ведет образовательную деятельность, финансовое обеспечение которой осуществляется за счет бюджетных ассигнований федерального бюджета.',
            'Учреждение не ведет образовательную деятельность, финансовое обеспечение которой осуществляется за счет бюджетов субъектов РФ.',
            'Учреждение не ведет образовательную деятельность, финансовое обеспечение которой осуществляется за счет местных бюджетов.'
        ]
    }
];

const vacancyItems = [
    {
        title: 'Количество вакантных мест для приема (перевода)',
        list: true,
        content: [
            'За счет бюджетных ассигнований федерального бюджета - ',
            'За счет бюджетов субъектов Российской Федерации -',
            'За счет местных бюджетов -',
            'За счет средств физических и (или) юридических лиц -',
            'Общее количество вакантных мест - 10'
        ]
    }
];

const grantsItems = [
    {
        title: 'Стипендии и меры поддержки обучающихся',
        content: 'Не предусмотрено'
    }
];

const internationalItems = [
    {
        title: 'Международное сотрудничество',
        content: 'ИП Аладьина В.Е. не ведет международное сотрудничество'
    }
];

const nutritionItems = [
    {
        title: 'Организация питания в образовательной организации',
        content: [
            'Не предусмотрено'
        ]
    }
];
</script>
<template>
    <section class="about">
        <ContainerComponent>
            <div class="info">
                <div class="content">
                    <h6>Основные сведения</h6>
                    <Accordion :items="generalItems" :multiple="true" />
                    <h6>Структура и органы управления образовательной организацией</h6>
                    <Accordion :items="structureItems" :multiple="true" />
                    <h6>Документы</h6>
                    <Accordion :items="documentItems" :multiple="true" />
                    <h6>Образование</h6>
                    <Accordion :items="educationItems" :multiple="true" />
                    <h6>Руководство</h6>
                    <Accordion :items="managementItems" :multiple="true" />
                    <h6>Педагогический состав</h6>
                    <Accordion :items="teacherItems" :multiple="true" />
                    <h6>Материально-техническое обеспечение и оснащенность образовательного процесса. Доступная среда</h6>
                    <Accordion :items="techItems" :multiple="true" />
                    <h6>Платные образовательные услуги</h6>
                    <Accordion :items="payItems" :multiple="true" />
                    <h6>Финансово-хозяйственная деятельность</h6>
                    <Accordion :items="financeItems" :multiple="true" />
                    <h6>Вакантные места для приема (перевода) обучающихся</h6>
                    <Accordion :items="vacancyItems" :multiple="true" />
                    <h6>Стипендии и меры поддержки обучающихся</h6>
                    <Accordion :items="grantsItems" :multiple="true" />
                    <h6>Международное сотрудничество</h6>
                    <Accordion :items="internationalItems" :multiple="true" />
                    <h6>Организация питания в образовательной организации</h6>
                    <Accordion :items="nutritionItems" :multiple="true" />
                </div>
            </div>
        </ContainerComponent>
    </section>
</template>
<style lang="scss" scoped>
.about {
    background-color: var(--card-pink);
    padding-top: 60px;
    .container {
        display: flex;
        flex-direction: column;
        .info {
            display: flex;
            flex-direction: row;
            gap: 60px;
            margin-bottom: 60px;
            .content {
                width: 100%;
                h6 {
                    font-size: 22px;
                    margin: 28px 0;
                }
                ul {
                    list-style-type: none;
                    margin: 0;
                    padding: 0;
                    margin-bottom: 20px;
                    li {
                        font-size: 18px;
                        line-height: 30px;
                        font-weight: lighter;
                    }
                }
            }
        }
    }
}

@include breakpoint(md) {
    .about {
        .container {
            .info {
                flex-direction: column;
                gap: 60px;
            }
        }
    }
}
</style>
